Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider class provides the creation commands for creating a BentPlate typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider class.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider.Conical
Gets the creation command parameters for creating a conical bent plate.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider.Cylindrical
Gets the creation command parameters for creating a cylindrical bent plate.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BentPlateTypeProvider.StandaloneBend
Gets creation command parameters for creating only bend surface.